import random
"""
a = {"칼로리 계산":"칼로리 500 이하면 no angry, 초과면 angry 출력하셈. 숫자로 주어짐. 1은 400, 2는 340, 3은 170, 4는 100, 5는 70",
     "빠진 숫자":"n개 숫자 있었는데 거기서 하나 빠진 숫자 찾으셈. n주어주고 n-1개의 빠진 후 자료 하나씩 줌(줄바꿔서 입력됨).",
     "순환 문자열":"순환 문자열이라고 대충 끝말잇기 생각하면 됨 앞의 마지막자가 뒤에 첫자랑 같아야 하고 마지막 단어 마지막이랑 첫 단어 마지막이랑 같아야 함. 단어는 3개 줄거임",
     "삼각형 판단":" 변 길이 세개 띄워서 한줄로 줄테니 그거로 제일 큰 놈<나머지 두변 합 이용해서 yes no 출력",
     "짝수 합":"숫자 하나 줄테니 거기까지의 자연수이면서 짝수의 합 구하셈",
     "30분 전":"시 분으로 줄테니 30분전 시간 구해서 시 분으로 출력하셈. 24시간제",
     "마름모 출력":"마름모 출력",
     "두번째로 작은 값":"띄워서 숫자 줄테니 두번쨰로 작은값만 출력",
     "숫자 갖고 놀기":"준거 뒤집고 왼쪽 0뗀거랑 거기에서 각자리 합 더한거 한줄로 출력",
     "삼각형 종류 판별":"말 그대롭니다",
     }
"""
b = ["칼로리 계산", "빠진 숫자", "순환 문자열", "삼각형 판단", "짝수 합", "30분 전", "마름모 출력", "두번째로 작은 값", "숫자 갖고 놀기", "삼각형 종류 판별"]

c = random.randint(1, 11)
print(b[c])
while True:
    d = input("Is right?")
    if d == "y":
        c = random.randint(1, 11)
        print(b[c])
    if d == "n":
        print(b[c])
